if OS.mac?
  # Applications
  cask "postman"
elsif OS.linux?
  brew "xclip"
end

# Packages
brew "git"
brew "htop"
brew "jq"
brew "neovim"
brew "markdown"
brew "python"
brew "tmux"
brew "vim"
brew "tree"
brew "wget"
brew "z"
brew "zsh"
brew "nmap"
cask "visual-studio-code"
brew "dos2unix"
<<<<<<< HEAD
=======
brew "nvim"
>>>>>>> dfe56031f76251a508bc5ae2a2383897a9e6ad68

