if OS.mac?
  # Applications
  cask "postman"
  cask "visual-studio-code"
elsif OS.linux?
  brew "xclip"
end

# Packages
brew "git"
brew "htop"
brew "jq"
brew "neovim"
brew "markdown"
brew "tmux"
brew "tree"
brew "wget"
brew "zsh"
brew "nmap"
brew "dos2unix"
brew "ncdu"
brew "stow"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "btop"
brew "uv"
brew "pnpm"
brew "ffmpeg"

# Version managers (see zsh/.zshrc)
brew "fnm"
brew "mise"
brew "pyenv"
brew "pyenv-virtualenv"
