42crunch.vscode-openapi
adpyke.codesnap
anthropic.claude-code
astro-build.astro-vscode
azemoh.one-monokai
azurite.azurite
bradlc.vscode-tailwindcss
burkeholland.simple-react-snippets
charliermarsh.ruff
christian-kohler.npm-intellisense
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
docker.docker
donjayamanne.githistory
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
formulahendry.auto-rename-tag
github.vscode-github-actions
golang.go
grapecity.gc-excelviewer
hashicorp.terraform
hediet.vscode-drawio
heybourn.headwind
igorsbitnev.error-gutters
inu1255.easy-snippet
johnpapa.vscode-peacock
kevinrose.vsc-python-indent
kisstkondoros.vscode-gutter-preview
mathematic.vscode-pdf
meganrogge.template-string-converter
mhutchie.git-graph
mikestead.dotenv
ms-azuretools.vscode-azure-github-copilot
ms-azuretools.vscode-azure-mcp-server
ms-azuretools.vscode-azureappservice
ms-azuretools.vscode-azurefunctions
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-azurestorage
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.isort
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode.vscode-websearchforcopilot
naumovs.color-highlight
njpwerner.autodocstring
openai.chatgpt
pkief.material-icon-theme
pmneo.tsimporter
quicktype.quicktype
redhat.vscode-xml
redhat.vscode-yaml
ritwickdey.liveserver
shd101wyy.markdown-preview-enhanced
stivo.tailwind-fold
streetsidesoftware.code-spell-checker
teamsdevapp.ms-teams-vscode-extension
tumido.cron-explained
twxs.cmake
usernamehw.errorlens
vincaslt.highlight-matching-tag
visualstudioonlineapplicationinsights.application-insights
wallabyjs.console-ninja
wayou.vscode-todo-highlight
yoavbls.pretty-ts-errors
yzane.markdown-pdf
